request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://superdev.io/student-service">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:getStudentRequest>
         <ser:id>${body[id]}</ser:id>
      </ser:getStudentRequest>
   </soapenv:Body>
</soapenv:Envelope>
